Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveFromChainMultipleIntersWithDivLine Property
 A curve from the chain formed by these curve elements either intersects a gridline more than once or coincides with it and so the chain will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveFromChainMultipleIntersWithDivLine { get; }
Public Shared ReadOnly Property DividedSurfaceCurveFromChainMultipleIntersWithDivLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveFromChainMultipleIntersWithDivLine {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveFromChainMultipleIntersWithDivLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace